var app = {};
app.translations = {

  tj: {
    english_lang: "Aнглисӣ",
    tajik_lang: "Тоҷикӣ",
    russian_lang: "Русӣ",
    home: "Асосӣ",
    about: "Дар бораи мо",
    parents: "Барои волидон",
    educators: "Барои омӯзгорон",
    students: "Барои хонандагон",
    faq: "Саволҳо",
    get_started: "Оғоз",

    //main page
    //slider 1
    rs_1_layer_1: "Барои Хонандагон",
    rs_1_layer_2: "Беҳтарин роҳи баланд бардоштани натиҷаҳои таълим",
    rs_1_layer_3: "Пешрафти худро пайгирӣ кунед <br>ва тестҳоро тариқи онлайн пешниҳод кунед!",
    go_to_students: "Ба қисмати хонандагон гузаред",

    //slider 2
    rs_2_layer_1: "Барои омӯзгорон",
    rs_2_layer_2: "Беҳтарин усули иртибот бо хонандагони худ",
    rs_2_layer_3: "Бо хонандагони худ бо истифода аз викторинаҳо <br> ва супоришҳо иртибот намоед",
    go_to_teachers: "Ба қисмати омӯзгорон гузаред",

    //slider 3
    rs_3_layer_1: "Барои Волидон",
    rs_3_layer_2: "Пешрафти фарзанди худро дастгирӣ кунед",
    rs_3_layer_3: "Муваффақияти фарзанди худро <br> назорат кунед ва ба онҳо барои пешрафти бештар кӯмак намоед.",
    go_to_parents: "Ба қисмати волидон гузаред",

    welcome_to: "Хуш омадед",
    mm_portal: "БА ПЛАТФОРМАИ ОМӮЗИШИ РАҚАМИИ МАКТАБ МОБАЙЛ ",
    available: "Барои ҳамаи хонандагон, омӯзгорон ва волидони Ҷумҳурии Тоҷикистон дастрас аст",
    welcome_desc: "Мактаб Мобайл нахустин платформаи омӯзиши рақамии Вазорати маориф ва илми Ҷумҳурии Тоҷикистон мебошад, ки дар ҳама гуна воситаҳо (компютерҳо, планшетҳо, телефонҳои мобилӣ) ҳам тариқи онлайн ва офлайн барои мусоидат ба омӯзиш ва рушди салоҳиятҳо таҳия гардидааст",
    know_more: "Маълумоти бештар →",
    what_can_you_do: 'ШУМО ТАВАССУТИ МАКТАБ МОБАЙЛ <span class="text-theme-color-2 font-weight-400">ЧИ МЕТАВОНЕД КАРД? ',
    access_learning_resources: "Дастрасӣ ба маводи омӯзишӣ",
    acces_learning_desc: "Маводи омӯзишии рақамиро ба монанди китобҳои дарсӣ, видео, маводи хониш зеркашӣ ва истифода баред",
    engage_in_learning: "Бо раванди таълим машғул шавед",
    do_homework: "Иҷрои вазифаи хонагӣ ва супоришҳо аз тарафи хонандагон",
    asses_learning: "Муваффақиятҳои омӯзиширо арзёбӣ мекунанд",
    asses_learning_desc: "Дастовардҳои синфии худро шарҳ диҳед",
    review_progress: "Пешрафтро баррасӣ намоед",
    review_progress_desc: "Пешрафти омӯзишро тавассути дастрасии фардӣ нишон диҳед",
    how_do_reach_disconnected: 'ЧИ ТАВР МАКТАБ МОБАЙЛ БА ШАХСОНИ <span class="text-theme-color-2 font-weight-400">БЕ ДАСТРАСӢ</span> БА ИНТЕРНЕТ КУМАК МЕКУНАД?',
    upload_content: "МАЗМУНРО БОРГИРӢ НАМОЕД",
    upload_content_desc: "Танҳо як бор мундариҷаро боргирӣ кунед ва истифодаи Мактаб Мобайл-ро ба таври мустақим идома диҳед",
    ensure_sync: "ТАЪМИНИ ҲАМОҲАНГСОЗӢ",
    ensure_sync_desc: "Ҳамоҳангсозии навигариҳоро бо хонандагон, ҳамсинфон ва ҳамсолони худ тариқи офлайн таъмин намоед",
    use_peer: "ИСТИФОДАБАРИИ ҲАМСОЛ БА ҲАМСОЛ",
    use_peer_desc: "Машғулиятҳоро идома дода, мундариҷаро офлайн бо истифода аз функсияи ҳамсол ба ҳамсол ва тавассути Bluetooth ё Wi-fi Direct мубодила намоед",
    learning_package: "Бастаи омӯзишӣ",
    learning_package_desc: "Маҷмӯи маводи омодашуда барои тамос бо <br>хонандагон",
    national_curriculum: "Барномаи таълимӣ",
    national_curriculum_desc: "Барномаи таълимӣ аз ҷониби омӯзгорони касбӣ барои иртиботи осон бо хонандагон таҳия шудааст",
    additional_reading_resources: "Маводи иловагии хониш",
    additional_reading_resources_desc: "Маҷмӯи маводи хониш барои таҳсил ва омӯзиш",
    educational_video: "Маводи видеоии таълимӣ",
    educational_video_desc: "Видео наворҳо аз ҷониби мутахассисон бо мақсади ҳалли мушкилиҳои таълимии хонандагон таҳия шудаанд",

    happy_students: "ХОНАНДАГОНИ ХУШБАХТ",
    number_resources: "ШУМОРАИ МАВОДИ ТАЪЛИМӢ",
    number_teachers: "ШУМОРАИ ОМӮЗГОРОН",
    awards_won: "ҶОИЗАҲО",
    our_gallery: 'Махзани <span class="text-theme-color-2 font-weight-400"> расмҳо</span>',
    all: "Ҳама",
    teachersg: "Омӯзгорон",
    studentsg: "Хонандагон",
    parentsg: "Волидон",

    partners: "Шарикон :",



    //footer
    maktab_desc_footer: "Maktab Mobile нахустин портали омӯзиши электронии Вазорати маориф ва илм мебошад, ки дар ҳама ҷо кор мекунад (компютерҳо, планшетҳо, телефонҳои мобилӣ) ҳам on-line ва ҳам ғайрирасмӣ барои омӯзиш ва дарёфти салоҳият мусоидат мекунанд.",
    quick_links: "Истинодҳои зуд",
    homef: "Асосӣ",
    aboutf: "Дар бораи мо",
    parentsf: "Барои волидон",
    teachersf: "Барои омӯзгорон",
    studentsf: "Барои хонандагон",
    //faqf: "Саволҳо",
    email: "Суроғаи электронӣ",
    dushanbe: "Душанбе, Тоҷикистон",

    //about page
    about_title: "Дар бораи мо",
    homeb: "Асосӣ",
    aboutb:"Дар бораи мо",
    what_is_mm: "МАКТАБ МОБАЙЛ ЧИСТ?",
    what_is_mm_desc: "Мактаб Мобайл барномаест бо интерфейси оддӣ барои омӯзиши рақамии хонандагон ва такмили ихтисоси омӯзгорон таҳия шудааст.",
    what_is_mm_desc2: "Мактаб Мобайл видео, китобҳои дарсии электронӣ, маводи таълимии интерактивиро дастгирӣ намуда, тавассути он дастрасӣ ва мубодилаи мазмуну супоришҳои таълимӣ, идоракунии дарсҳо ва нақшаҳои дарс, маводу супоришҳо оид ба такмили ихтисоси омӯзгорон ба таври мустақим таъмин карда мешавад. Мактаб Мобайл ҳам онлайн ва ҳамчунон офлайн фаъолият мекунад.",
    who_can_benefit_from: "МАКТАБ МОБАЙЛ БАРОИ КӢ ТАҲИЯ ГАРДИДААСТ?",

    teacherss: "Омӯзгорон",
    teacherssb: "Омӯзгорон",
    teacherssb_d: "Платформаи омӯзишии Мактаб Мобайл ба омӯзгорон имкон медиҳад, ки мундариҷаи дарсро ба тариқи нав ва ҷолиб пешниҳод намоянд. Дар платформа дарсҳо бо унсурҳои гуногуни мултимедия, аз ҷумла видеоҳо, аниматсияҳо, аксҳо ва сабти аудио мавҷуданд. ",
    parentss: "Волидон",
    parentssb: "Волидон",
    parentssb_d: "Агар шумо иштироки фаъолро дар таълиму тарбияи кӯдакони худ қадр мекунед, пас ба шумо лозим меояд, ки бо платформаи омӯзиши Мактаб Мобайл аз наздик шинос шавед. Кӯшиши кӯмак ба фарзандонатон дар иҷрои супоришҳои хонагӣ душвор буда метавонад, агар шумо намедонед, ки чӣ гуна раванди омӯзиши рақамии онҳо пайгирӣ намоед.",
    studentss: "Хонандагон",
    studentssb: "Хонандагон",
    studentssb_d: "Мактаб Мобайл машқҳои амалӣ, видеоҳои таълимӣ ва лавҳаи омӯзиши инфиродиро пешниҳод мекунад, ки ба хонандагон имкон медиҳад, ки дар синф ва ё берун аз он таҳсил кунед.",
    our_features: '<span class="text-theme-color-2 font-weight-400">Хусусиятҳои</span> мо',

    libraryB: "Китобхона",
    libraryBdesc: "Дастрасӣ ба машғулиятҳои дарсӣ, иҷрои супоришҳои таълимӣ тавассути интихоб ва истифодаи китобҳои рақамӣ, машқҳои интерактивӣ ва ё видео-наворҳо аз китобхона, ки ба шумо дар омӯзиши кӯмак мерасонанд",

    offline_support: "Дастгирии ғоибона",
    offline_support_desc: "Ҳамаи функсияҳо тариқи онлайн ё офлайн фаъолият мекунад. Ҳангоми пайвастшавӣ, баҳо ва пешниҳодҳои шумо ба таври худкор ҳамоҳанг мешаванд",

    interactive_learning: "Дастгирии омӯзиши интерактивӣ",
    interactive_learning_desc: "Мазмуни таълимиро ба осонӣ илова, нест ва таҳрир намоед. Дастгирии дарунсохти мундариҷаи мавҷудаи шумо, аз ҷумла видео, аудио, EPUB, PDF ва Experience API",

    class_management: "Идоракунии синфҳо",
    class_management_desc: "Супоришҳои синфӣ эҷод кунед, пешрафти хонандагонро пайгирӣ кунед ва фикру мулоҳизаҳои худро барои хонандагон сабт намоед",

    attendance: "Давомот",
    attendance_desc: "Тафсилоти дарсҳо, тақвимҳо ва иштрирокро идора намоед",

    reports: "Гузориш",
    reports_desc: "Гузориши муассир, содда ва мустақим аз ҷониби омӯзгорон ва хонандагон",

    //for teachers
    for_teachers_b : "Барои Омӯзгорон ",
    homeb : "Асосӣ",
    teachersb: "Барои Омӯзгорон ",
    how_do_teachers_use: 'Омӯзгорон аз <span class="text-theme-color-2 font-weight-400">Maktab Мобайл</span> чӣ гуна истифода мебаранд?',
    how_do_teachers_use_desc: "Платформаи омӯзишии Мактаб Мобайл ба омӯзгорон имкон медиҳад, ки мундариҷаи дарсро ба тариқи нав ва ҷолиб пешниҳод намоянд. Дар платформа дарсҳо бо унсурҳои гуногуни мултимедия, аз ҷумла видеоҳо, аниматсияҳо, аксҳо ва сабти аудио мавҷуданд. Дарсҳо бо унсурҳои интерактивӣ мегузаранд, ки аз хонандагон талаб мекунанд, ки барои гузаштан ба зинаи дигар супоришро иҷро намоянд. Таъмини таҷрибаҳои ҷолиб эҳтимолияти онро дорад, ки хонандагон омӯзишро гуворо ва хотирмон хоҳанд ёфт. Платформаи омӯзишии Мактаб Мобайл дорои воситаҳо ва маводи муассири омӯзишӣ барои хонандагони сатҳҳои гуногуни таҳсилот мебошад. Бартариҳои асосии платформаи омӯзишии Мактаб Мобайл:<br> •	Эҷоди таҷрибаҳои ҷолиб ва мултимедиявӣ барои хонандагон<br> •	Таълимро ба таври худкор аз рӯи қобилияти хонандагон ба роҳ монед<br> •	Пешрафти хонандагонро аз рӯи мақсадҳои асосии таълимӣ пайгирӣ намоед",

    how_to_download_and_register: 'Чӣ тавр  <span class="text-theme-colored"> барнома дар дастгоҳи худ зеркашӣ </span><br> ва сабти ном карда мешавад?',
    download_1: "Қадами 1: Ба Гугл Плей/Плей Маркет гузаред ва барномаи “Мактаб Мобайл” -ро зеркашӣ кунед. ",
    download_2: "Қадами 2: Дархости рамзи синф аз омӯзгори худ. ",
    download_3: "Қадами 3: Ном ва дигар маълумот барои тамосро ба қайд гиред.",
    go_to_google1: "Ба Google Play гузаред",

    how_to_create_class: 'Чӣ гуна <span class="text-theme-colored"> бояд синф эҷод кард </span><br> ва донишҷӯёнро илова кард?',
    how_to_create_class_desc: 'Ба қисмати "Илова кардани синф" гузаред ва тафсилоти синфро, ки ба он дарс медиҳед, ворид кунед,. Дар қисмати "Номи синф" маълумоти синфи худро ворид кунед.',
    go_to_google2: "Ба Google Play гузаред",

    how_to_create_classwork: 'Кори синфиро <span class="text-theme-colored"> чӣ гуна бояд сохт?',
    how_to_create_classwork_desc: 'Барои ворид намудани кори синфӣ, тугмаи "+ кори синфӣ" -ро зер кунед. Сарлавҳаи синфро пур кунед ва мӯҳлати иҷро/пешниҳоди онро гузоред. Инчунин шумо бояд муайян кунед, ки аз хонандагони худ кадом навъи ҷавобу пешниҳодро интизоред. Дар қисмати "Дастур барои хонандагон" ба кӯдакон дастурҳои аниқ диҳед, ки чӣ гуна ҷавобу пешниҳоди худро омода кунанд. Кори синфӣ ихтиёрӣ метавонад саволҳои викторина дошта бошад, ки хонандагон дар қисмати "Шарҳи озод" ҷавоб дода, пешниҳод кунанд.',
    go_to_google3: "Ба Google Play гузаред",

    how_to_see_student_progress: 'Пешрафти хонандаро <span class="text-theme-colored"> чӣ гуна дидан мумкин аст  </span><br> ва супоришҳоро чӣ тавр қайд кардан мумкин аст?',
    how_to_see_student_progress_desc: 'Барои шарҳи пешрафти хоандагон ва якчанд супоришҳоро қайд кардан, ба қисмати "Пешрафти хонандагон" гузаред. Он ба шумо шумораи супоришҳои "Қайдшуда", "Пешниҳодшуда" ва "Пешниҳод нашудааст" -ро нишон медиҳад. Пас аз он ки шумо пешниҳоди хонандагонро баррасӣ карда, аломат гузоштед, тугмачаи "Бозгашт ва Қайди минбаъда" -ро зер кунед.',
    go_to_google4: "Ба Google Play гузаред",

    how_to_send_comments: 'Чӣ гуна <span class="text-theme-colored"> шарҳҳоро ба донишҷӯён фиристодан мумкин аст? </span>',
    how_to_send_comments_desc: 'Ду роҳи фиристодани эродҳо/фикру мулоҳизаҳо вуҷуд дорад: ба тамоми синф ва фардӣ ба хонандагони алоҳида. Барои илова намудани шарҳ ба тамоми синф ба фосилаи "Шарҳи синф илова кунед" равед. Барои илова кардани шарҳи хусусӣ ба донишҷӯёни инфиродӣ, ба фосилаи "Шарҳи хусусӣ илова кунед" равед.',
    go_to_google5: "Ба Google Play гузаред",

    general_tips_for_teachers: 'Маслиҳатҳои умумӣ барои омӯзгорон оид ба истифодаи барнома',
    tip1: 'Боварӣ ҳосил намоед, ки дастгоҳи шумо барои дастрасӣ ба ҳамаи дарсҳои барнома дар ҳолати корӣ қарор дорад.',
    tip2: "Боварӣ ҳосил кунед, ки омӯзгорон ва падару модарони онҳо рақами шахсии шумо (ё Viber, рақами вотсап) дошта бошанд, то ҳар вақте ки онҳо ҳангоми иҷрои супоришҳо ба мушкилӣ дучор  дучор шаванд, бо шумо тамос гиранд",

    try_now: "Гузаред",

    //for parents
    for_parents_t: "Барои Волидон",
    for_parents_b: "Барои Волидон",

    how_parents_use_mm: 'Волидон аз  <span class="text-theme-color-2 font-weight-400">Maktab Мобайл</span> чӣ гуна истифода мебаранд?',
    how_to_download_and_register_p: 'Чӣ гуна <span class="text-theme-colored"> барнома зеркашӣ карда мешавад  </span><br> ва барои сабти номи фарзандатон кӯмак кунед',
    how_parents_use_mm_d: "Агар шумо иштироки фаъолро дар таълиму тарбияи кӯдакони худ қадр мекунед, пас ба шумо лозим меояд, ки бо платформаи омӯзиши Мактаб Мобайл аз наздик шинос шавед. Кӯшиши кӯмак ба фарзандонатон дар иҷрои супоришҳои хонагӣ душвор буда метавонад, агар шумо намедонед, ки чӣ гуна раванди омӯзиши рақамии онҳо пайгирӣ намоед.<br> Иштироки шумо дар таҳсили фарзандатон метавонад ба натиҷаҳо ва дастовардҳои беҳтари таълимии онҳо оварда расонад. Платформаи омӯзишиии Мактаб Мобайл ба шумо ҳамчун падару модар ё парастор имконияти аз пешрафти фарзанди шумо ҳангоми дастрасӣ ва истифодаи технологияи омӯзишӣ огоҳӣ пайдо намоед.",
    step_1p: "Қадами 1: Ба Гугл Плей/Плей Маркет гузаред ва барномаи “Мактаб Мобайл” -ро зеркашӣ кунед. ",
    step_2p: "Қадами 2: Дархости рамзи синф аз омӯзгори фарзанди худ дархост намоед. ",
    step_3p: "Қадами 3: Ном ва дигар маълумоти барои тамоси фарзанди худро қайд кунед.",

    how_to_monitor_child: 'Чӣ гуна <span class="text-theme-colored"> пешрафти фарзанди худро назорат  </span><br> ва шарҳи омӯзгоронро тавассути барнома дидан мумкин аст? ',
    how_to_monitor_child_desc: 'Барои дидани баҳо ва пешрафти фарзанди худ, ба нишондиҳандаи иҷрошавӣ гузаред. Нишондиҳандаи иҷрошавӣ пешрафти онҳоро дар доираи қисми зерин нишон медиҳад. Инчунин, Шумо метавонед шарҳҳои шахсии омӯзгорро бинед, ва дар сурати фаъол будани ин амал аз ҷониби омӯзгор, ба онҳо ҷавоб диҳед.',

    how_to_contect_teacher: 'Чӣ тавр <span class="text-theme-colored">  тавассути барнома бо омӯзгор тамос гирифтан мумкин аст? </span>',
    how_to_contect_teacher_desc: 'Қадами 1: Барномаи “Мактаб Мобайл”-ро фаъол намоед. ',
    how_to_contect_teacher_desc2: 'Қадами 2: Ба қисми синфҳо гузаред ва баъд синфи лозимаро интихоб карда ба қисми “Кори синфӣ” гузаред. Вазифаеро, ки мехоҳед иҷро кунед, интихоб намоед. Вазифаеро, ки оид ба он савол доред интихоб кунед. Ин ҷо Шумо метавонед шарҳҳои фардиро ба омӯзгори худ фиристед.',

    tip_f_p: "Боварӣ ҳосил кунед, ки омӯзгорон рақами шахсии шумо (ё Viber, рақами вотсап) дошта бошанд, то ҳар вақте ки онҳо ҳангоми иҷрои супоришҳо ба мушкилӣ дучор  дучор шаванд, бо шумо тамос гиранд",

    //for students
    for_students_b: "Барои Хонандагон",
    for_studentsb: "Барои Хонандагон",
    how_do_students_use: 'Хонандагон аз  <span class="text-theme-color-2 font-weight-400">Maktab Мобайл </span>чӣ гуна истифода мебаранд? ?',
    how_do_students_use_d: "Мактаб Мобайл машқҳои амалӣ, видеоҳои таълимӣ ва лавҳаи омӯзиши инфиродиро пешниҳод мекунад, ки ба хонандагон имкон медиҳад, ки дар синф ва ё берун аз он таҳсил кунед. <br>Тавассути платформаи Мактаб Мобайл, иртиботи шумо бо омӯзгор ва дастрасӣ ба маводи таълимӣ бемаҳдуд шудааст ва тамоми мактаб ба осонӣ дар компютерҳо ва планшетҳои шумо ҷой мегирад. ",

    how_to_download_student: 'Чӣ тавр <span class="text-theme-colored">  барнома дар дастгоҳи худ зеркашӣ  </span><br> ва сабти ном карда мешавад?',
    how_to_download_student_1: 'Қадами 1: Ба Гугл Плей/Плей Маркет гузаред ва барномаи “Мактаб Мобайл” -ро зеркашӣ кунед. ',
    how_to_download_student_2: 'Қадами 2: Дархости рамзи синф аз омӯзгори худ. ',
    how_to_download_student_3: 'Қадами 3: Ном ва дигар маълумот барои тамосро ба қайд гиред.',

    how_to_acce_teachers: 'Чӣ гуна <span class="text-theme-colored">  ба супоришҳои омӯзгорон дастрасӣ пайдо кардан мумкин аст? </span>',
    how_to_acce_teachers_d2: "Қадами 1: барномаи “Мактаб Мобайл”-ро кушоед. ",
    how_to_acce_teachers_d3: 'Қадами 2) Ба дарсҳо гузаред, пас синфи дилхоҳатонро интихоб кунед ва пас ба ҷадвали "Кори Синфӣ" гузаред. Шумо рӯйхати супоришҳои омӯзгоратонро барои синфи худ мебинед.',

    how_to_submit_answers: 'Чӣ гуна <span class="text-theme-colored">  ҷавобҳоро пешниҳод кардан   </span>ва пешрафти худро дидан мумкин аст?',
    how_to_submit_answers_1: 'Қадами 1: барномаи “Мактаб Мобайл”-ро кушоед.  ',
    how_to_submit_answers_2: 'Қадами 2: Ба дарсҳо гузаред, пас синфи дилхоҳатонро интихоб кунед ва пас ба ҷадвали "Кори синфӣ" гузаред. Супоришеро, ки мехоҳед иҷро намоед, интихоб кунед. Шумо метавонед мундариҷаи марбут (масалан, китобҳои электронӣ) ва пешрафти худро дар зери сарлавҳаи Мазмун бубинед ва шумо метавонед ҷавобҳои худро зери сарлавҳаи Пешниҳод ирсол намоед.',

    how_to_view_marks: 'Чӣ гуна <span class="text-theme-colored">  пешрафт </span><br> ва баҳои худро дидан мумкин аст?',
    how_to_view_marks_1: 'Қадами 1: барномаи “Мактаб Мобайл”-ро кушоед. ',
    how_to_view_marks_2: 'Қадами 2) Ба дарсҳо гузаред, пас синфи дилхоҳатонро интихоб кунед ва пас ба ҷадвали "Кори синфӣ" гузаред. Шумо пешрафти худро барои ҳар як супориш ва баҳои гирифтаатонро мебинед.',

    tips_students: "Маслиҳатҳои умумӣ барои хонандагон оид ба истифодаи барнома",
    tips_students_1: "Боварӣ ҳосил намоед, ки дастгоҳи шумо фаъол аст ва ба интернет пайваст карда шудааст, то ба ҳама дарсҳои барнома дастрасӣ пайдо кунед",
    tips_students_2: "Барои таҳсил ҷои ором ёбед. Хонаи алоҳида надоред? Пас, гӯшмонак пӯшед. Мизи корӣ надоред? Мизи ошхона метавонад ҳар рӯз дар муддати муайян мизи кории шумо шавад. ",
    tips_students_3: "Тартиби ҳаррӯзаи худро ба нақша гиред ва ба он риоя кунед. Ин ба шумо кӯмак мекунад, ки самаранокии омӯзишатонро баланд бардоред.",
    tips_students_4: "Ҳар гоҳе ки дар раванди омӯзиш ба монеа дучор оед, аз падару модар ва дигар калонсолон кӯмак пурсед.",
    tips_students_5: "Агар шумо ҳангоми иҷрои супориш ба мушкилӣ дучор оед, аз иконияти сӯҳбат ва машварт истифода баред ва ба омӯзгор паёми фардӣ фиристед.",
    
  },

  ru: {
    english_lang: "Английский",
    tajik_lang: "Таджикский",
    russian_lang: "Русский",
    home: "Главная страница",
    about: "О Мактаб – Мобайл",
    parents: "Для родителей",
    educators: "Для учителей",
    students: "Для учеников",
    faq: "Вопросы и ответы ",
    get_started: "Начать",

    //main page
    //slider 1
    rs_1_layer_1: "Для учеников",
    rs_1_layer_2: "Лучший способ повысить результаты обучения",
    rs_1_layer_3: "Отслеживайте свой прогресс <br>и отправляйте тесты онлайн!",
    go_to_students: "Перейти к ученикам",

    //slider 2
    rs_2_layer_1: "Для учителей",
    rs_2_layer_2: "Лучший способ общения со своими учениками",
    rs_2_layer_3: "Взаимодействуйте со своими учениками с помощью интерактивного контента, <br> тестирования и заданий.",
    go_to_teachers: "Перейти к учителям",

    //slider 3
    rs_3_layer_1: "Для родителей",
    rs_3_layer_2: "Поддержите прогресс вашего ребенка",
    rs_3_layer_3: "Следите за успехами вашего ребенка <br> и помогайте ему достичь большего.",
    go_to_parents: "Перейти к родителям",

    welcome_to: "ДОБРО ПОЖАЛОВАТЬ",
    mm_portal: "НА ПОРТАЛ ЦИФРОВОГО ОБУЧЕНИЯ МАКТАБ-МОБАЙЛ ",
    available: "Доступно для всех учащихся, учителей и родителей в Республике Таджикистан",
    welcome_desc: "Мактаб-Мобайл — это первый портал цифрового обучения Министерства образования и науки, который работает всех устройсвах (компьютерах, планшетах, мобильных телефонах) как в режиме онлайн, так и в автономном режиме, способствуя обучению и приобретению компетенций",
    know_more: "Узнать больше →",
    what_can_you_do: 'ЧТО ВЫ МОЖЕТЕ СДЕЛАТЬ С ПОМОЩЬЮ <span class="text-theme-color-2 font-weight-400">МАКТАБ-МОБАЙЛ? ',
    access_learning_resources: "Доступ к учебным ресурсам",
    acces_learning_desc: "Загружайте и используйте цифровые учебные ресурсы, такие как учебники, видео, ресурсы для чтения",
    engage_in_learning: "Участвуйте в процессе обучения",
    do_homework: "Выполняйте домашние задания и давайте задания ученикам",
    asses_learning: "Оценивайте учебные достижения",
    asses_learning_desc: "Обзор достижений вашего класса",
    review_progress: "Обзор Прогресса",
    review_progress_desc: "Просмотреть прогресс обучения с помощью персонализированного доступа",
    how_do_reach_disconnected: 'КАК МАКТАБ - МОБАЙЛ ДОСТИГАЕТ ТЕХ, <span class="text-theme-color-2 font-weight-400">У КОГО</span>  НЕТ ИНТЕРНЕТА?',
    upload_content: "ЗАГРУЗКА КОНТЕНТА",
    upload_content_desc: "Загрузив контент только раз, можно продолжить использование Мактаб - Мобайл в автономном режиме",
    ensure_sync: "ОБЕСПЕЧЬТЕ СИНХРОНИЗАЦИЮ",
    ensure_sync_desc: "Обеспечьте синхронизацию обновлений между вашими учениками, одноклассниками и коллегами в автономном режиме",
    use_peer: "ИСПОЛЬЗОВАНИЕ ОДНОРАНГОВЫХ СОЕДИНЕНИЙ",
    use_peer_desc: "Продолжайте работать и обмениваться контентом в автономном режиме через одноранговое распределение с помощью Bluetooth или Wi-fi",
    learning_package: "УЧЕБНЫЙ ПАКЕТ",
    learning_package_desc: "Специально подготовленный набор ресурсов для взаимодействия с вашими <br>учениками",
    national_curriculum: "Национальная учебная программа",
    national_curriculum_desc: "Национальная учебная программа, подготовленная профессиональными преподавателями для облегчения взаимодействия с учениками",
    additional_reading_resources: "Дополнительные ресурсы для чтения",
    additional_reading_resources_desc: "Набор ресурсов для чтения, предназначенных для изучения и обучения",
    educational_video: "Образовательные видео ресурсы",
    educational_video_desc: "Видео подготовлены профессионалами, чтобы облегчить обучение учеников",

    happy_students: "СЧАСТЛИВЫЕ УЧЕНИКИ",
    number_resources: "КОЛИЧЕСТВО РЕСУРСОВ",
    number_teachers: "КОЛИЧЕСТВО УЧИТЕЛЕЙ",
    awards_won: "ЗАВОЕВАННЫЕ НАГРАДЫ",
    our_gallery: 'ГАЛЕРЕЯ <span class="text-theme-color-2 font-weight-400"> </span>',
    all: "Все",
    teachersg: "Учителя",
    studentsg: "Ученики",
    parentsg: "Родители",

    partners: "Партнеры: ",



    //footer
    maktab_desc_footer: "Мактаб-Мобайл — это первый портал цифрового обучения Министерства образования и науки, который работает всех устройсвах (компьютерах, планшетах, мобильных телефонах) как в режиме онлайн, так и в автономном режиме, способствуя обучению и приобретению компетенций",
    quick_links: "Быстрые ссылки",
    homef: "Главная страница",
    aboutf: "О Мактаб – Мобайл",
    parentsf: "Для родителей",
    teachersf: "Для учителей",
    studentsf: "Для учеников",
    //faqf: "Саволҳо",
    email: "Электронная почта",
    dushanbe: "Душанбе, Таджикистан",

    //about page
    about_title: "О Мактаб – Мобайл",
    homeb: "Главная страница",
    aboutb:"О Мактаб – Мобайл",
    what_is_mm: "ЧТО ТАКОЕ МАКТАБ –  МОБАЙЛ?",
    what_is_mm_desc: "Мактаб –  Мобайл – в это платформа с простым и удобным интерфейсом для цифрового обучения, разработанная для учителей и учеников.",
    what_is_mm_desc2: "Мактаб –  Мобайл поддерживает видео, электронные книги, интерактивный контент, позволяет использовать и обмениваться контентом в автономном режиме, поддерживает управление классами и заданиями, а также возможностью распространения планов уроков, заданий по профессиональному развитию. Мактаб –  Мобайл работает как онлайн, так и оффлайн.",
    who_can_benefit_from: "КТО МОЖЕТ ИЗВЛЕЧЬ ПОЛЬЗУ ИЗ МАКТАБ –  МОБАЙЛ ?",

    teacherss: "Учителя",
    teacherssb: "Учителя",
    teacherssb_d: "Мактаб –  Мобайл цифровая обучающая платформа позволяет учителям преподавать содержание уроков новыми и интересными способами. Платформа включает в себя уроки с различными мультимедийными элементами, включая видео, анимацию, рисунки и аудиозаписи.  ",
    parentss: "Родители",
    parentssb: "Родители",
    parentssb_d: "Если вы являетесь родителем, который ценит участие и активность в обучении своих детей, вам необходимо ознакомиться с платформой цифрового обучения Мактаб – Мобайл. Попытка помочь вашим детям с домашним заданием может быть трудной, если вы не знаете, как ориентироваться в их системе цифрового обучения.",
    studentss: "Ученикам",
    studentssb: "Ученикам",
    studentssb_d: "Мактаб – Мобайл предлагает практические упражнения, обучающие видеоролики и персонализированную панель мониторинга обучения, которая позволяет ученикам учиться в вашем собственном темпе в классе и за его пределами.",
    our_features: '<span class="text-theme-color-2 font-weight-400">НАШИ </span> ОСОБЕННОСТИ',

    libraryB: "Библиотека",
    libraryBdesc: "Получите доступ к классной работе, выполняйте задания и выбирайте электронные книги, интерактивные упражнения или видео из библиотеки, чтобы помочь вам учиться.",

    offline_support: "Автономная поддержка",
    offline_support_desc: "Все работает онлайн или оффлайн. Ваши результаты и материалы автоматически синхронизируются при повторном подключении.",

    interactive_learning: "Интерактивная поддержка обучения",
    interactive_learning_desc: "Легко добавлять, удалять и редактировать образовательный контент. Встроенная поддержка существующего контента, включая видео, аудио, EPUB, PDF и файлы API.",

    class_management: "Управление классами",
    class_management_desc: "Создавайте задания в классе, отслеживайте прогресс учащихся и записывайте свои отзывы и оценки для учащихся.",

    attendance: "Посещаемость",
    attendance_desc: "Управляйте сведениями о классе, календарями и записывайте посещаемость.",

    reports: "Отчеты",
    reports_desc: "Эффективная, упорядоченная отчетность непосредственно от преподавателей и учеников.",

    //for teachers
    for_teachers_b : "Для учителей ",
    homeb : "Главная страница",
    teachersb: "Для учителей",
    how_do_teachers_use: 'Как учителя используют <span class="text-theme-color-2 font-weight-400">Мактаб – Мобайл</span> ?',
    how_do_teachers_use_desc: "Мактаб –  Мобайл цифровая обучающая платформа позволяет учителям преподавать содержание уроков новыми и интересными способами. Платформа включает в себя уроки с различными мультимедийными элементами, включая видео, анимацию, рисунки и аудиозаписи. Уроки сопровождаются интерактивными элементами, требующие выполнение задания учащимися, для дальнейшего продвижения. Предоставление увлекательного путешествия во время обучения, повышает вероятность того, что ученики найдут обучение приятным и запоминающимся. Мактаб –  Мобайл цифровая обучающая платформа может стать эффективным инструментом обучения для учащихся на многих уровнях образования.<br>Ключевые преимущества цифровой обучающей платформы Мактаб –  Мобайл:<br>• Создание увлекательного мультимедийного учебного опыта для учеников<br>• Различать инструкции автоматически в зависимости от способностей учащихся<br>• Отслеживать прогресс учащихся в достижении ключевых целей обучения",

    how_to_download_and_register: 'Как загрузить приложение <span class="text-theme-colored">  и зарегистрироваться</span><br>?',
    download_1: "Шаг 1: Перейдите в Google store/Play market и загрузите приложение 'Мактаб – Мобайл'",
    download_2: "Шаг 2: Запросите ссылку или код у своего школьного учителя",
    download_3: "Шаг 3: Зарегистрируйте свое имя и другие контактные данные.",
    go_to_google1: "Перейти в Google Play",

    how_to_create_class: 'Как создать класс <span class="text-theme-colored"> </span><br> и добавить студентов?',
    how_to_create_class_desc: 'Перейдите в раздел "Добавить класс" и введите сведения о классе, в котором вы преподаете. В поле "Имя класса" введите класс и название вашего класса.',
    go_to_google2: "Перейти в Google Play",

    how_to_create_classwork: 'Как создать <span class="text-theme-colored">классную работу?',
    how_to_create_classwork_desc: 'Чтобы создать классную работу, нажмите на кнопку "+ работа класса". Заполните название классной работы и укажите крайний срок подачи. Вам также нужно будет указать, какой тип представления вы ожидаете от своих учеников. В разделе "Инструкции для учеников" дайте детям чёткие инструкции о том, как подготовить свои ответы. В классной работе по желанию могут быть тестирующие вопросы, на которые учащиеся отвечают в пространстве "Комментарии" и отправляют.',
    go_to_google3: "Перейти в Google Play",

    how_to_see_student_progress: 'Как увидеть прогресс ученика <span class="text-theme-colored"></span><br> и как отметить задания?',
    how_to_see_student_progress_desc: 'Чтобы просмотреть прогресс ученика и количество пунктов, которые вы должны отметить, перейдите на панель "Прогресс ученика". Он покажет вам количество "Помеченных", "Отправленных" и "Не отправленных" заданий. После того, как вы просмотрите заявку ученика и поставите отметку, нажмите на кнопку "Вернуться и отметить далее".',
    go_to_google4: "Перейти в Google Play",

    how_to_send_comments: 'Как отправить <span class="text-theme-colored">комментарии ученикам? </span>',
    how_to_send_comments_desc: 'Есть два варианта отправки комментариев/отзывов: всему классу и личным образом отдельным ученикам. Чтобы добавить комментарий ко всему классу, перейдите в раздел "Добавить комментарий к классу". Чтобы добавить личный комментарий отдельному ученику, перейдите в раздел "Добавить личный комментарий".',
    go_to_google5: "Перейти в Google Play",

    general_tips_for_teachers: 'Общие советы для учителей о том, как использовать приложение',
    tip1: 'Убедитесь, что ваше устройство заряжено для доступа ко всем урокам приложения',
    tip2: "Убедитесь, что у ваших учеников и их родителей есть ваш личный номер (или номер Viber, WhatsApp), чтобы они могли связаться с вами, когда у них возникнут трудности с выполнением заданий",

    try_now: "Перейти",

    //for parents
    for_parents_t: "Для родителей",
    for_parents_b: "Для родителей",

    how_parents_use_mm: 'Как родители используют <span class="text-theme-color-2 font-weight-400">Maktab Мобайл</span> Мактаб – Мобайл?',
    how_to_download_and_register_p: 'Как скачать приложение <span class="text-theme-colored"> и помочь ребенку зарегистрироваться?  </span><br>',
    how_parents_use_mm_d: "Если вы являетесь родителем, который ценит участие и активность в обучении своих детей, вам необходимо ознакомиться с платформой цифрового обучения Мактаб – Мобайл. Попытка помочь вашим детям с домашним заданием может быть трудной, если вы не знаете, как ориентироваться в их системе цифрового обучения.<br>Ваше участие в образовании вашего ребенка может привести к лучшим результатам и итогам обучения. Цифровая обучающая платформа Мактаб – Мобайл будет информировать вас, как родителя или опекуна, о том, как вы отслеживаете прогресс вашего ребенка, когда ваш ребенок получает доступ к технологиям и использует их для обучения.",
    step_1p: "Шаг 1: Перейдите в Google store/Play market и загрузите приложение ' Мактаб – Мобайл' ",
    step_2p: "Шаг 2: Запросите ссылку или код у своего школьного учителя; ",
    step_3p: "Шаг 3: Зарегистрируйте свое имя и другие контактные данные",

    how_to_monitor_child: 'Как следить за прогрессом вашего ребенка  <span class="text-theme-colored"> и просматривать комментарии учителей через приложение?  </span><br> ',
    how_to_monitor_child_desc: 'Чтобы просмотреть отметки и прогресс вашего ребенка, перейдите на индикатор выполнения.  Индикатор выполнения показывает их прогресс в этом пункте содержимого. Вы также можете просматривать личные комментарии, отправленные учителем, и отвечать на них, если эта функция разрешена учителем.',

    how_to_contect_teacher: 'Как связаться с учителем <span class="text-theme-colored">  через приложение? </span>',
    how_to_contect_teacher_desc: 'Шаг 1: Откройте мобильное приложение Мактаб – Мобайл. ',
    how_to_contect_teacher_desc2: 'Шаг 2: Перейдите к классам, затем выберите нужный класс, а затем перейдите на вкладку «Работа с Классами». Выберите задание, над которым вы хотите работать. Выберите задание, о котором идет речь в вашем вопросе. Вы можете отправить личный комментарий своему учителю здесь.',

    tip_f_p: "Убедитесь, что у ваших учитилей есть ваш личный номер (или номер Viber, WhatsApp), чтобы они могли связаться с вами, когда у них возникнут трудности с выполнением заданий",

    //for students
    for_students_b: "Для учеников",
    for_studentsb: "Для учеников",
    how_do_students_use: 'Как ученики используют <span class="text-theme-color-2 font-weight-400">Maktab Мобайл </span>Мактаб – Мобайл?',
    how_do_students_use_d: "Мактаб – Мобайл предлагает практические упражнения, обучающие видеоролики и персонализированную панель мониторинга обучения, которая позволяет ученикам учиться в вашем собственном темпе в классе и за его пределами. С помощью платформы Мактаб – Мобайл ваше взаимодействие с учителями, доступ к преподавательским и обучающим ресурсам становятся неограниченными, школа становиться мобильной и может легко поместиться на ваших компьютерах и планшетах.",

    how_to_download_student: 'Как загрузить приложение на свое устройство <span class="text-theme-colored">  и зарегистрироваться? </span><br>',
    how_to_download_student_1: 'Шаг 1: Перейдите в Google store/Play market и загрузите приложение " Мактаб – Мобайл"',
    how_to_download_student_2: 'Шаг 2: Запросите код у своего школьного учителя',
    how_to_download_student_3: 'Шаг 3: Зарегистрируйте свое имя и другие контактные данные.',

    how_to_acce_teachers: 'Как получить доступ <span class="text-theme-colored">  к заданиям учителя?</span>',
    how_to_acce_teachers_d2: "Шаг 1: Откройте приложение Мактаб Мобайл",
    how_to_acce_teachers_d3: 'Шаг 2: Перейдите в раздел классы, затем выберите нужный класс, а затем перейдите на вкладку «Работа с Классами». Вы увидите список заданий для этого класса от вашего учителя.',

    how_to_submit_answers: 'Как отправить ответы <span class="text-theme-colored">  и просмотреть свой прогресс?</span>',
    how_to_submit_answers_1: 'Шаг 1: откройте приложение Мактаб – Мобайл. ',
    how_to_submit_answers_2: 'Шаг 2: Перейдите в раздел «классы», затем выберите нужный класс, а затем перейдите на вкладку «Работа с Классами». Выберите задание, над которым вы хотите работать. Вы можете просмотреть любой связанный контент (например, электронные книги) и свой прогресс в разделе «Контент», а также отправить свои ответы в разделе «Отправка».',

    how_to_view_marks: 'Как просмотреть свой прогресс <span class="text-theme-colored"></span><br> и свои оценки?',
    how_to_view_marks_1: 'Шаг 1: Откройте приложение Мактаб Мобайл. ',
    how_to_view_marks_2: 'Шаг 2: Перейдите в раздел «классы», затем выберите нужный класс, а затем перейдите на вкладку «Работа с Классами». Вы увидите свой прогресс по каждому заданию и отметку, которую вы получили.',

    tips_students: "Общие советы для учеников о том, как использовать приложение",
    tips_students_1: "Убедитесь, что ваше устройство заряжено и подключено к Интернету, чтобы получить доступ ко всем урокам приложения",
    tips_students_2: "Найдите тихое место для занятий. У вас нет отдельной комнаты? Тогда, наденьте наушники. У вас нет письменного стола? Кухонный стол может быть вашим рабочим столом в течение нескольких часов каждый день.",
    tips_students_3: "Планируйте свой распорядок дня и придерживайтесь его. Это поможет вам повысить эффективность обучения. Просите помощи у своих родителей всякий раз, когда вы сталкиваетесь с препятствиями в учебном процессе.",
    tips_students_4: "Если у вас возникли трудности с выполнением задания, не стесняйтесь использовать инструмент чата и отправить личное сообщение учителю.",
    tips_students_5: "",
    
  }
};

$( document ).ready(function() {
  setLanguage(getCookie('lang') || 'tj');
});
 function setLanguage (language) {
  console.log('setting language ' + language);
  document.documentElement.lang = language;
  var currentLanguage = getCookie('lang');
  var text = {};
  text = app.translations[currentLanguage] || app.translations['tj'];
  console.log(text);
  changeLogo(currentLanguage || 'tj');
  changePartnerLogos(currentLanguage || 'tj');
  for (const property in text) {
    // console.log(`${property}: ${app.lang[property]}`);
    if (document.getElementById(property) != null && currentLanguage != "en") {
      document.getElementById(property).innerHTML = text[property];
    //  document.getElementById(property).style.fontFamily = 'OpenSans';
    }
  }
}

function setCookieAndReload(language) {
  var x = getCookie('lang');
  if (x) {
    if (x != language) {
      eraseCookie('lang');
      setCookie('lang', language, 7);
    }
  } else {
    setCookie('lang', language, 7);
  }
  console.log(getCookie('lang'));
  location.reload();
}

function setCookie(name, value, days) {
  var expires = "";
  if (days) {
    var date = new Date();
    date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
    expires = "; expires=" + date.toUTCString();
  }
  document.cookie = name + "=" + (value || "") + expires + "; path=/";
}
function getCookie(name) {
  var nameEQ = name + "=";
  var ca = document.cookie.split(';');
  for (var i = 0; i < ca.length; i++) {
    var c = ca[i];
    while (c.charAt(0) == ' ') c = c.substring(1, c.length);
    if (c.indexOf(nameEQ) == 0) return c.substring(nameEQ.length, c.length);
  }
  return null;
}
function eraseCookie(name) {
  document.cookie = name + '=; Path=/; Expires=Thu, 01 Jan 1970 00:00:01 GMT;';
}

function changeLogo(lang) {
  var img = document.getElementById("logo_img");
  var ministry = document.getElementById("logo_ministry");
  var footer_logo = document.getElementById("footer_logo");
  if(lang=='tj'){
    img.src = "images/logo-wide-tj.png";
    ministry.src = "images/ministr-resized-tj.png";
    footer_logo.src = "images/logo-wide-white-tj.png";
  }else if(lang == 'ru') {
    img.src = "images/logo-wide-ru.png";
    footer_logo.src = "images/logo-wide-white-ru.png";
    ministry.src = "images/ministr-resized-ru.png";
  }
}

function changePartnerLogos(lang) {
  var partner_moes = document.getElementById("moes");
  var partner_eu = document.getElementById("eu");
  var partner_unicef = document.getElementById("unicef");
  if(lang=='tj'){
    partner_moes.src = "images/moes-tj.png";
    partner_eu.src = "images/un-tj.png";
    partner_unicef.src = "images/unicef-tj.png";
  }else if(lang=='ru') {
    partner_moes.src = "images/moes-ru.png";
    partner_eu.src = "images/un-ru.png";
    partner_unicef.src = "images/unicef-ru.png";
  }
}

